CSI API ETABS v1
cCaseStaticNonlinear.GetHingeUnloading Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetHingeUnloading(
	string Name,
	ref int UnloadType
)
Function GetHingeUnloading (
	Name As String,
	ByRef UnloadType As Integer
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim UnloadType As Integer
Dim returnValue As Integer
returnValue = instance.GetHingeUnloading(Name,
	UnloadType)
int GetHingeUnloading(
	String^ Name,
	int% UnloadType
)
abstract GetHingeUnloading :
        Name : string *
        UnloadType : int byref -> int
Parameters
Name
Type: System.String
UnloadType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace